#!/usr/local/bin/python3
# -*- coding: UTF-8 -*-

import tensorflow as tf


# shape = [2,3,4,1]
t = [  # 阶0，两个元素
        [ # 阶1，三个元素
            [ #阶2，四个元素，
                [1111],   # 这个的都是是阶2的分隔符，分割成四个元素
                [1121], 
                [1131],
                [1141]  # 阶3，一个元素，不需要分隔符
            ]
            ,  # 阶1的分割符，分割成三个元素
            [                [1211], [1221], [1231], [1241]            ]
            ,
            [                [1311], [1321], [1331], [1341]            ]
        ]
    ,  # 阶0的分隔符，分割成两个元素
        [
            [                [2111], [2121], [2131], [2141]             ]
            ,
            [                [2211], [2221], [2231], [2241]            ]
            ,
            [                [2311], [2321], [2331], [2341]            ]
        ]
    ]

